const settings = require('../settings');
const fs = require('fs');
const path = require('path');

async function helpCommand(sock, chatId, message) {
const tsh = {
    key: {
        fromMe: false,
        participant: `0@s.whatsapp.net`,
        ...(message.chat ? { remoteJid: "status@broadcast" } : {})
    },
    message: {
        contactMessage: {
            displayName: '🌹𝗞𝗨𝗥𝗔𝗠𝗔 𝗠𝗗🌹',
            vcard: `BEGIN:VCARD\nVERSION:3.0\nN:;META AI;;;\nFN:META AI\nitem1.TEL;waid=242066191337:242066191337\nitem1.X-ABLabel:Mobile\nitem2.EMAIL;type=INTERNET:info@meta.com\nitem2.X-ABLabel:Email\nitem3.URL:https://orax-tsh.netlify.app/\nitem3.X-ABLabel:Domaine\nEND:VCARD`
        }
    }
}
    const helpMessage = `
*╭─────── ·𑁍· ─────── · ·*
*┊╭────────────────*
*┊│──────♢*
*┊│💀︱ᴄʀᴇᴀᴛᴏʀ : \`ᴀʟᴘʜᴀ ʙʟᴏᴏᴅ ᴀɴɢᴇʟ\`*
*┊│💀︱ʙᴏᴛ : ᴋᴜʀᴀᴍᴀ ᴍᴅ ᴠ2*
*┊│💀︱ᴠᴇʀsɪᴏɴ : 1.2.0*
*┊│💀︱ᴘʀᴇғɪx : "."*
*│┊──────♢*
*╰───────────────*
*╭───〔 𝐊𝐔𝐑𝐀𝐌𝐀 𝐌𝐃 𝐁𝐎𝐓 〕───╮*
*│✪┏━♰*
*│✪╏──〔 𝐆𝐑𝐎𝐔𝐏𝐄-𝐌𝐄𝐍𝐔 〕──*
*│✪╏🌹→ᴘʀᴏᴍᴏᴛᴇ*
*│✪╏🌹→ᴅᴇᴍᴏᴛᴇ*
*│✪╏🌹→ᴘᴜʀɢᴇ [ ᴋɪᴄᴋᴀʟʟ ]*
*│✪╏🌹→ᴘᴜʀɢᴇ2 [ ᴏɴᴇsʜᴏᴛ ]*
*│✪╏🌹→ᴀɴᴛɪʟɪɴᴋ*
*│✪╏🌹→ᴍᴜᴛᴇ*
*│✪╏🌹→ᴜɴᴍᴜᴛᴇ*
*│✪╏🌹→ᴛᴀɢᴀʟʟ*
*│✪╏🌹→ᴡᴇʟᴄᴏᴍᴇ ᴏɴ - ᴏғғ*
*│✪╏🌹→ᴅᴇʟᴇᴛᴇ*
*│✪╏🌹→ᴄʟᴇᴀʀ*
*│✪╏🌹→ᴀɴᴛɪᴅᴇʟᴇᴛᴇ ᴏɴ - ᴏғғ*
*│✪╏🌹→ʀᴇᴘᴏ - sᴄ - ɢɪᴛ*
*│✪╏🌹→ᴘʀᴏᴍᴏᴛᴇᴀʟʟ*
*│✪╏🌹→sᴇᴛᴘᴘ*
*│✪╏🌹→ɢʀᴏᴜᴘɪɴғᴏ*
*│✪╏🌹→ɢᴏᴏᴅʙʏᴇ*
*│✪╏🌹→ᴀɴᴛɪᴛᴀɢ ᴏɴ - ᴏғғ*
*│✪╏──〔 𝐀𝐈 𝐱 𝐈𝐌𝐀𝐆𝐄-𝐌𝐄𝐍𝐔 〕──*
*│✪╏🌹→ɢᴘᴛ*
*│✪╏🌹→ɪᴍᴀɢɪɴᴇ*
*│✪╏🌹→ɢᴇᴍɪɴɪ*
*│✪╏🌹→ғʟᴜx*
*│✪╏🌹→sᴏʀᴀ*
*│✪╏🌹→ᴄᴏᴍᴘʟɪᴍᴇɴᴛ*
*│✪╏🌹→ɪɴsᴜʟᴛ*
*│✪╏🌹→ғʟɪʀᴛ*
*│✪╏──〔 𝐎𝐖𝐍-𝐌𝐄𝐍𝐔 〕──*
*│✪╏🌹→ᴍᴇɴᴜ*
*│✪╏🌹→ʜᴇʟᴘ*
*│✪╏🌹→ᴋᴜʀᴀᴍᴀ*
*│✪╏🌹→ᴘɪɴɢ*
*│✪╏🌹→ᴠᴠ*
*│✪╏🌹→ᴀᴜᴛᴏʀᴇᴀᴄᴛ ᴏɴ/ᴏғғ*
*│✪╏🌹→ʟʏʀɪᴄs*
*│✪╏🌹→ᴍᴏᴅᴇ ᴘᴜʙʟɪᴄ - ᴘʀɪᴠᴀᴛᴇ*
*│✪╏🌹→ᴀᴜᴛᴏᴛʏᴘɪɴɢ ᴏɴ - ᴏғғ*
*│✪╏🌹→ᴀᴜᴛᴏʀᴇᴀᴅ ᴏɴ - ᴏғғ*
*│✪╏🌹→sᴜᴅᴏ*
*│✪╏🌹→ᴛᴏᴜʀʟ - ᴜʀʟ*
*│✪╏🌹→ᴜᴘᴅᴀᴛᴇ*
*│✪╏🌹→sᴇᴛᴛɪɴɢs*
*│✪╏🌹→ᴘᴍʙʟᴏᴄᴋᴇʀ*
*│✪╏🌹→ᴀʟɪᴠᴇ*
*│✪╏──〔 𝐒𝐓𝐈𝐂𝐊𝐄𝐑𝐒-𝐌𝐄𝐍𝐔 〕──*
*│✪╏🌹→sᴛɪᴄᴋᴇʀ*
*│✪╏🌹→ᴛᴀᴋᴇ <ᴘᴀᴄᴋ ɴᴀᴍᴇ>*
*│✪╏🌹→ᴇᴍᴏᴊɪᴍɪx 😂+😭*
*│✪╏🌹→ɪɢs*
*│✪╏🌹→ɪɢsᴄ*
*│✪╏🌹→ʀᴇᴍᴏᴠᴇʙɢ*
*│✪╏🌹→s*
*│✪╏🌹→sɪᴍᴀɢᴇ*
*│✪╏──〔 𝐃𝐎𝐖𝐍-𝐌𝐄𝐍𝐔 〕──*
*│✪╏🌹→ᴘʟᴀʏ - sᴏɴɢ*
*│✪╏🌹→ᴠɪᴅᴇᴏ*
*│✪╏🌹→sᴘᴏᴛɪғʏ*
*│✪╏🌹→ɪɴsᴛᴀɢʀᴀᴍ*
*│✪╏🌹→ғᴀᴄᴇʙᴏᴏᴋ*
*│✪╏🌹→ᴛɪᴋᴛᴏᴋ*
*│✪╏🌹→ᴛᴇʟᴇsᴛɪᴄᴋ <ʟɪɴᴋ ᴛɢ ᴘᴀᴄᴋ>*
*│✪┗━♰*
*╰────────────────────────╯*
> *©ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴍʀ ʙʟᴏᴏᴅ ᴀɴɢᴇʟ* :`;

    try {
        const imagePath = path.join(__dirname, '../assets/bot_image.jpg');
        
        if (fs.existsSync(imagePath)) {
            const imageBuffer = fs.readFileSync(imagePath);
            
            await sock.sendMessage(chatId, {
                image: imageBuffer,
                caption: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363408210681586@newsletter',
                        newsletterName: '𝐊𝐔𝐑𝐀𝐌𝐀-𝐌𝐃_𝐕𝟐 🌹',
                        serverMessageId: -1
                    }
                }
            },{ quoted: tsh });
        } else {
            console.error('Bot image not found at:', imagePath);
            await sock.sendMessage(chatId, { 
                text: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363408210681586@newsletter',
                        newsletterName: '𝐊𝐔𝐑𝐀𝐌𝐀-𝐌𝐃_𝐕𝟐',
                        serverMessageId: -1
                    } 
                }
            });
        }
    } catch (error) {
        console.error('Error in help command:', error);
        await sock.sendMessage(chatId, { text: helpMessage });
    }
}

module.exports = helpCommand;